wendylabsinc/wendy-lite/sdkconfig.defaults
# Target: ESP32-C6
CONFIG_IDF_TARGET="esp32c6"

# Flash size (8MB to accommodate dual WASM slots)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition table - custom for dual WASM slots
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# WAMR configuration
CONFIG_WENDY_WASM_STACK_SIZE=8192
CONFIG_WENDY_WASM_HEAP_SIZE=0
# 0 = use system allocator (no pre-allocated pool). Trades the hard guest
# ceiling for letting wifi DMA buffers and the wasm runtime share heap
# dynamically. With a 224 KiB pre-allocated pool on ESP32-C6, the DMA pool
# was being starved to single bytes, breaking outbound wifi entirely.
CONFIG_WENDY_WASM_POOL_SIZE=0
# Classic interpreter uses less RAM than the fast interpreter.
CONFIG_WAMR_INTERP_CLASSIC=y
# CONFIG_WAMR_INTERP_FAST is not set

# Disable WAMR pthread (causes assert in FreeRTOS tasks)
# CONFIG_WAMR_ENABLE_LIB_PTHREAD is not set
# CONFIG_WAMR_ENABLE_SHARED_MEMORY is not set

# Disable WAMR built-in WASI (we provide our own shim)
# CONFIG_WAMR_ENABLE_LIBC_WASI is not set
# CONFIG_WAMR_ENABLE_MEMORY_PROFILING is not set

# Swift async executables use table/ref instructions from the runtime.
CONFIG_WAMR_ENABLE_REF_TYPES=y

# Wendy HAL defaults
CONFIG_WENDY_HAL_GPIO=y
CONFIG_WENDY_HAL_I2C=y
CONFIG_WENDY_HAL_TIMER=y
CONFIG_WENDY_HAL_NEOPIXEL=y

# Callback subsystem
CONFIG_WENDY_CALLBACK=y

# System functions
CONFIG_WENDY_SYS=y

# NVS storage
CONFIG_WENDY_STORAGE=y

# UART
CONFIG_WENDY_UART=y

# SPI
CONFIG_WENDY_SPI=y

# OpenTelemetry
CONFIG_WENDY_OTEL=y

# WASI shim
CONFIG_WENDY_WASI_SHIM=y

# BLE stack (NimBLE)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2

# BLE provisioning and discovery
CONFIG_WENDY_BLE_PROV=y

# Cloud provisioning (device certificates via BLE)
CONFIG_WENDY_CLOUD_PROV=y

# Cloud mTLS connection
CONFIG_WENDY_CLOUD_ENABLED=y

# mbedTLS memory — dynamic buffers avoid a large upfront allocation at ssl_setup
# time. Without this, mbedtls_ssl_setup fails with MBEDTLS_ERR_SSL_ALLOC_FAILED
# (-0x7F00) because WiFi+BLE+WAMR leave insufficient contiguous heap.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=8192

# App-facing BLE host functions disabled by default
# CONFIG_WENDY_BLE is not set

# App-facing networking (sockets, DNS, TLS)
CONFIG_WENDY_NET=y

# App-facing USB disabled by default (no OTG on C6)
# CONFIG_WENDY_APP_USB is not set

# USB CDC not available on C6 (no native USB OTG)
# CONFIG_WENDY_USB_CDC_ENABLED is not set

# WiFi transport for WASM download
CONFIG_WENDY_WIFI_ENABLED=y
CONFIG_WENDY_WIFI_SSID=""
CONFIG_WENDY_WIFI_PASSWORD=""

# Console over UART (compatible with Wokwi and most debug setups)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# --- Memory optimizations ---

# 1. Size-optimized build (-Os instead of -Og)
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=1

# 2. Disable stack overflow canary (saves RAM per task)
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_NONE=y

# Move WiFi/PHY hot paths from IRAM to flash (frees ~15-25 KB DIRAM)
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_EXTRA_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_SLP_IRAM_OPT=n
CONFIG_ESP_PHY_IRAM_OPT=n

# 3. Tune NimBLE buffer pools (sized for max 2 connections)
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=12
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=12
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=8
CONFIG_BT_NIMBLE_TRANSPORT_EVT_COUNT=12
CONFIG_BT_NIMBLE_TRANSPORT_EVT_DISCARD_COUNT=4
